/********************************************************
*                                                                                                            
* 文 件 名： UnitConver.c
* 版权说明：  
* 创建时间： 2013-10-25
* 作    者： 郭文章
* 功能描述： 单位换算
* 修改记录：   
*
********************************************************/
#include "UnitConver.h"


/***********************************************************************
 * 方法名   : HourConvertSec
 * 功能描述 : 将小时转化为秒数
 * 输入参数 : 
 *     const UINT8_S hour     小时 
 * 返回值   : 秒数
 ***********************************************************************/
UINT32_S HourConvertSec(const UINT8_S hour)
{
    UINT32_S tmpSec = 0;/*秒数*/

    tmpSec = hour*3600;

    return tmpSec;
}


/***********************************************************************
 * 方法名   : KmsConvertCMPS
 * 功能描述 : 单位转换 km/s-->cmps
 * 输入参数 : 
 *     const UINT16_S kmph  km/s
 * 返回值   : cmps
 ***********************************************************************/
FLOAT32_S KmsConvertCMPS(const UINT16_S kmph)
{
    return (FLOAT32_S)((kmph*100)/3.6);
}


/***********************************************************************
 * 方法名   : CmsConvertKMPH
 * 功能描述 : 单位转换 cm/s-->kmps
 * 输入参数 : 
 *     const UINT16_S cmps
 * 返回值   : kmps
 ***********************************************************************/
FLOAT32_S CmsConvertKMPH(const UINT16_S cmps)
{
    return (FLOAT32_S)(cmps*0.036);
}

/***********************************************************************
 * 方法名   : MsConvertSec
 * 功能描述 : 单位转换 ms-->s
 * 输入参数 : 
 *     const UINT32_S msc  ms
 * 返回值   : s
 ***********************************************************************/
UINT32_S MsConvertSec(const UINT32_S msc)
{
    return msc/1000;
}
