/********************************************************
*                                                                                                            
* 文 件 名： UnitConver.h
* 版权说明：  
* 创建时间： 2013-10-25
* 作    者： 
* 功能描述： 单位换算头文件
* 修改记录：   
*
********************************************************/
#ifndef UNITCONVER_H_
#define UNITCONVER_H_

#include "CommonTypes.h"


#ifdef __cplusplus
extern "C" {
#endif

/***********************************************************************
 * 方法名   : HourConvertSec
 * 功能描述 : 将小时转化为秒数
 * 输入参数 : 
 *     const UINT8_S hour     小时 
 * 返回值   : 秒数
 ***********************************************************************/
UINT32_S HourConvertSec(const UINT8_S hour);


/***********************************************************************
 * 方法名   : KmsConvertCMPS
 * 功能描述 : 单位转换 km/s-->cmps
 * 输入参数 : 
 *     const UINT16_S kmph  km/s
 * 返回值   : cmps
 ***********************************************************************/
FLOAT32_S KmsConvertCMPS(const UINT16_S kmph);

/***********************************************************************
 * 方法名   : CmsConvertKMPH
 * 功能描述 : 单位转换 cm/s-->kmps
 * 输入参数 : 
 *     const UINT16_S cmps
 * 返回值   : kmps
 ***********************************************************************/
FLOAT32_S CmsConvertKMPH(const UINT16_S cmps);

/***********************************************************************
 * 方法名   : MsConvertSec
 * 功能描述 : 单位转换 ms-->s
 * 输入参数 : 
 *     const UINT32_S msc  ms
 * 返回值   : s
 ***********************************************************************/
UINT32_S MsConvertSec(const UINT32_S msc);

#ifdef __cplusplus
}
#endif

#endif
